# Migración de datos de MySql a SQL Server

### Primero hay que hacer las conexiones a las bases de datos

In [112]:
import pandas as pd
from sqlalchemy import create_engine

mySqlConn = None
tSqlConn = None

def connectToDatabases():
    global mySqlConn
    global tSqlConn
    try:
        
        # Conectarse a MySQL
        mySqlConn = create_engine("mysql+mysqlconnector://root:123456@localhost/pay_assistant_db")
        
        print("Éxito!")


        # Conectarse a SQL Server
        # TODO
    
    except Exception as e:
        print (f"Error: {e}")

In [114]:
connectToDatabases()

Éxito!

### Una vez hechas las conexiones, se va a extraer todos los datos de mysql a migrar

In [80]:
# Instanciar las variables globales de las tablas con los datos a migrar
df_users = None
df_currencies = None
df_subscriptions = None
df_planPrices = None
df_planFeaturesSubscriptions = None
df_schedules = None
df_scheduleDetails = None
df_userPlanPrices = None

In [168]:
# Esta función hace todos los queries de las tablas y los guarda en DataFrames
def extractAllData():
    global df_users, df_currencies, df_subscriptions, df_planPrices, df_planFeaturesSubscriptions, df_schedules, df_scheduleDetails, df_userPlanPrices
    df_users = pd.read_sql("SELECT * FROM pay_users;",mySqlConn)
    df_currencies = pd.read_sql("SELECT * FROM pay_currencies;",mySqlConn)
    df_subscriptions = pd.read_sql("SELECT * FROM pay_subscriptions;",mySqlConn)
    df_planPrices = pd.read_sql("SELECT * FROM pay_plan_prices;",mySqlConn)
    df_planFeaturesSubscriptions = pd.read_sql("SELECT * FROM pay_plan_features_subscriptions;",mySqlConn)
    df_schedules = pd.read_sql("SELECT * FROM pay_schedules;",mySqlConn)
    df_scheduleDetails = pd.read_sql("SELECT * FROM pay_schedules_details;",mySqlConn)
    df_userPlanPrices = pd.read_sql("SELECT * FROM pay_users_plan_prices;",mySqlConn)

In [170]:
# Ahora se llama la función para meter todos los datos en los dataFrame
extractAllData()

### En esta parte se pueden ver los valores de las tablas al extraerse del MySql

In [133]:
df_users

,user_id,email,first_name,last_name,password,enabled
0,1,PaulaPonce1@gmail.com,Paula,Ponce,b'2bf5309e56428a57f073efd97e7668a08cfc74db0a44...,1
1,2,EmmaRamos2@gmail.com,Emma,Ramos,b'48e217aeaa990fa02a72367bda2ab6aeb77e87c9b4f4...,1
2,3,RicardoSalazar3@gmail.com,Ricardo,Salazar,b'228b4b3c75ace3216c8189a12cca88befb322d9696c2...,1
3,4,AnaGarcía4@gmail.com,Ana,García,b'0c44f0413a7351ae8a456633b6512797ea4cb515fa29...,1
4,5,MartaMejía5@gmail.com,Marta,Mejía,b'43fa4a3e9cdd525128edaa7b7b7fd330f41d3aeb44c2...,1
...,...,...,...,...,...,...
1045,1046,CamilaAcosta1046@gmail.com,Camila,Acosta,b'13a33a2c53304fffac7614be31a4bfe851f8a6d9f439...,1
1046,1047,LorenaRamírez1047@gmail.com,Lorena,Ramírez,b'850b066ee061196ac4ed3b237979a7197fa506228af5...,1
1047,1048,FranciscoEstrada1048@gmail.com,Francisco,Estrada,b'288d77e654df324e0d688d227f806c74034c3254792d...,1
1048,1049,JavierGuerrero1049@gmail.com,Javier,Guerrero,b'bd469a97a827aec59ef3593118fb364a0af0db1558f6...,1
1049,1050,ElenaFigueroa1050@gmail.com,Elena,Figueroa,b'21a6cffef3fce12cf6ed2a3ff79ade9ff80b4678fe77...,1

In [110]:
df_currencies

   currency_id                  name acronym symbol  country_id
0            1   Colón Costarricense     CRC      ₡           1
1            2  Dólar Estadounidense     USD      $           2

In [160]:
df_subscriptions

   subscription_id description
0                1    Estándar
1                2     Premium

In [142]:
df_planPrices

,plan_prices_id,subscrition_Id,amount,currency_id,postTime,endDate,current
0,1,1,9.99,2,2025-04-30 06:06:52,2025-12-31,1
1,2,2,39.99,2,2025-04-30 06:06:52,2025-12-31,1

In [144]:
df_planFeaturesSubscriptions

   plan_features_id  subscription_id value  enabled
0                 1                1    No        1
1                 1                2    Sí        1
2                 2                1    50        1
3                 2                2   200        1
4                 3                1     5        1

In [146]:
df_schedules

,schedule_id,name,repit,repetitions,recurrencyType,endDate,startDate
0,1,Pago Estándar Mensual,1,12,1,None,2025-04-30 06:06:52
1,2,Pago Premium Anual,0,1,2,None,2025-04-30 06:06:52

In [172]:
df_scheduleDetails

,schedules_details_id,deleted,schedule_id,baseDate,datePart,last_execute,next_execute,description,detail
0,1,0,1,2025-04-30 06:06:52,2025-01-01,None,2025-02-01,Pago mensual,Pago mensual de la suscripción Estándar
1,2,0,2,2025-04-30 06:06:52,2025-01-01,None,2026-01-01,Pago anual,Pago anual de la suscripción Premium

In [174]:
df_userPlanPrices

,user_plan_price_id,user_id,plan_prices_id,adquision,enabled,schedule_id
0,1,1,1,2025-03-28,1,1
1,2,2,1,2025-03-19,1,1
2,3,3,1,2025-04-16,1,1
3,4,4,1,2025-03-16,1,1
4,5,5,1,2025-02-08,1,1
...,...,...,...,...,...,...
1045,1046,1046,2,2025-03-12,1,2
1046,1047,1047,2,2025-04-25,1,2
1047,1048,1048,2,2025-02-12,1,2
1048,1049,1049,2,2025-02-16,1,2
1049,1050,1050,2,2025-03-25,1,2